name: "tensorrt_llm"
backend: "inflight_batcher_llm"
max_batch_size: 128

sequence_batching {
  max_sequence_idle_microseconds: 5000000
  oldest
  {
    max_candidate_sequences: 1024
  }
  control_input [
    {
      name: "START"
      control [
        {
          kind: CONTROL_SEQUENCE_START
          fp32_false_true: [ 0, 1 ]
        }
      ]
    },
    {
      name: "END"
      control [
        {
          kind: CONTROL_SEQUENCE_END
          fp32_false_true: [ 0, 1 ]
        }
      ]
    },
    {
      name: "CORRID"
      control [
        {
          kind: CONTROL_SEQUENCE_CORRID
          data_type: TYPE_UINT64
        }
      ]
    }
  ]
}

# # Uncomment this for dynamic_batching
# dynamic_batching {
#    max_queue_delay_microseconds: 50000
# }

input [
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [ -1 ]
  },
  {
    name: "input_lengths"
    data_type: TYPE_INT32
    dims: [ 1 ]
    reshape: { shape: [ ] }
  },
  {
    name: "request_output_len"
    data_type: TYPE_INT32
    dims: [ 1 ]
  }
#  {
#    name: "end_id"
#    data_type: TYPE_UINT32
#    dims: [ 1 ]
#    reshape: { shape: [ ] }
#    optional: true
#  },
#  {
#    name: "pad_id"
#    data_type: TYPE_UINT32
#    dims: [ 1 ]
#    reshape: { shape: [ ] }
#    optional: true
#  },
#  {
#    name: "beam_width"
#    data_type: TYPE_UINT32
#    dims: [ 1 ]
#    reshape: { shape: [ ] }
#    optional: true
#  },
#  {
#    name: "temperature"
#    data_type: TYPE_FP32
#    dims: [ 1 ]
#    reshape: { shape: [ ] }
#    optional: true
#  },
#  {
#    name: "runtime_top_k"
#    data_type: TYPE_UINT32
#    dims: [ 1 ]
#    reshape: { shape: [ ] }
#    optional: true
#  },
#  {
#    name: "runtime_top_p"
#    data_type: TYPE_FP32
#    dims: [ 1 ]
#    reshape: { shape: [ ] }
#    optional: true
#  },
#  {
#    name: "len_penalty"
#    data_type: TYPE_FP32
#    dims: [ 1 ]
#    reshape: { shape: [ ] }
#    optional: true
#  },
#  {
#    name: "repetition_penalty"
#    data_type: TYPE_FP32
#    dims: [ 1 ]
#    reshape: { shape: [ ] }
#    optional: true
#  },
#  {
#    name: "min_length"
#    data_type: TYPE_UINT32
#    dims: [ 1 ]
#    reshape: { shape: [ ] }
#    optional: true
#  },
#  {
#    name: "presence_penalty"
#    data_type: TYPE_FP32
#    dims: [ 1 ]
#    reshape: { shape: [ ] }
#    optional: true
#  },
#  {
#    name: "random_seed"
#    data_type: TYPE_UINT64
#    dims: [ 1 ]
#    reshape: { shape: [ ] }
#    optional: true
#  },
#  {
#    name: "output_log_probs"
#    data_type: TYPE_BOOL
#    dims: [ 1 ]
#    reshape: { shape: [ ] }
#    optional: true
#  }
]
output [
  {
    name: "output_ids"
    data_type: TYPE_INT32
    dims: [ -1, -1 ]
  }
#  {
#    name: "log_probs"
#    data_type: TYPE_FP32
#    dims: [ -1, -1 ]
#  }
]
instance_group [
  {
    count: 1
    kind : KIND_CPU
  }
]
parameters {
  key: "engine_dir"
  value: {
    string_value: "${engine_dir}"
  }
}
parameters: {
  key: "FORCE_CPU_ONLY_INPUT_TENSORS"
  value: {
    string_value: "no"
  }
}
parameters: {
  key: "gpt_model_type"
  value: {
    string_value: "V1"
  }
}
parameters: {
  key: "gpt_model_path"
  value: {
    string_value: "/triton_model_repo/tensorrt_llm/1/1-gpu"
  }
}
